wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
            } else if(pauseHoldStarted) {
                unsigned long t = millis();
                if(t - pauseHoldStartstamp > OF_Prefs::settings[OF_Const::holdToPauseLength]) {
                    // in the infinitely tiny chance that this happens at the same time as a serial-pinged Dock request:
                    if(FW_Common::gunMode == FW_Const::GunMode_Run) {
                        // Signal the main core to set mode, since it's more stable there.
                        // Pop blocks until we get the okay from the main core (the value returned doesn't matter atm)
                        #ifdef ARDUINO_ARCH_ESP32
                            esp32_fifo.push(FW_Const::GunMode_Pause);
                            esp32_fifo.pop();
                        #else // rp2040 
                        rp2040.fifo.push(FW_Const::GunMode_Pause);
                        rp2040.fifo.pop();
                        #endif
                    }
                }
            }
        } else {
            if(FW_Common::buttons.pressedReleased == FW_Const::EnterPauseModeBtnMask ||
               FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Home) {
                // in the infinitely tiny chance that this happens at the same time as a serial-pinged Dock request:
                if(FW_Common::gunMode == FW_Const::GunMode_Run) {
                    // Signal the main core to set mode, since it's more stable there.
                    // Pop blocks until we get the okay from the main core (the value returned doesn't matter atm)
                    #ifdef ARDUINO_ARCH_ESP32
                        esp32_fifo.push(FW_Const::GunMode_Pause);
                        esp32_fifo.pop();
                    #else // rp2040                    
                    rp2040.fifo.push(FW_Const::GunMode_Pause);
                    rp2040.fifo.pop();
                    #endif
                }
            }
        }
    }
}
#endif // DUAL_CORE
// #endif // ARDUINO_ARCH_RP2040 // 696969 tolto messo sopra

// Main core events hub
// splits off into subsequent ExecModes depending on circumstances
void loop()
{
    // poll/update button states with 1ms interval so debounce mask is more effective
    FW_Common::buttons.Poll(1);
    FW_Common::buttons.Repeat();

    if(OF_Prefs::toggles[OF_Const::holdToPause] && pauseHoldStarted) {
        #ifdef USES_RUMBLE
            if(OF_Prefs::toggles[OF_Const::rumble]) {
                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                delay(300);
                #ifdef ARDUINO_ARCH_ESP32
                    analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0); // 696969 per ESP32
                #else //rp2040
                digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                #endif
            }
        #endif // USES_RUMBLE

        // if any buttons are still held, keep polling until all buttons are debounced
        while(FW_Common::buttons.debounced)
            FW_Common::buttons.Poll(1);

        pauseHoldStarted = false;
        pauseModeSelectingProfile = false;
    }

    #ifdef MAMEHOOKER
        if(Serial.available()) OF_Serial::SerialProcessing();
    #endif // MAMEHOOKER

    switch(FW_Common::gunMode) {
        case FW_Const::GunMode_Pause:
            if(OF_Prefs::toggles[OF_Const::simplePause]) {
                if(pauseModeSelectingProfile) {
                    if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_A) {
                        SetProfileSelection(false);
                    } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_B) {
                        SetProfileSelection(true);
                    } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) {
                        FW_Common::SelectCalProfile(profileModeSelection);
                        pauseModeSelectingProfile = false;
                        FW_Common::pauseModeSelection = FW_Const::PauseMode_Calibrate;

                        if(!OF_Serial::serialMode) {
                            Serial.print("Switched to profile: ");
                            Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                            Serial.println("Going back to the main menu...");
                            Serial.println("Selecting: Calibrate current profile");
                        }

                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_Calibrate);
                        #endif // USES_DISPLAY

                    } else if(FW_Common::buttons.pressedReleased & FW_Const::ExitPauseModeBtnMask) {
                        if(!OF_Serial::serialMode)
                            Serial.println("Exiting profile selection.");

                        pauseModeSelectingProfile = false;

                        #ifdef LED_ENABLE
                            for(uint i = 0; i < 2; ++i) {
                                OF_RGB::LedUpdate(180,180,180);
                                delay(125);
                                OF_RGB::LedOff();
                                delay(100);
                            }
                            OF_RGB::LedUpdate(255,0,0);
                        #endif // LED_ENABLE

                        FW_Common::pauseModeSelection = FW_Const::PauseMode_Calibrate;

                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_Calibrate);
                        #endif // USES_DISPLAY
                    }
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_A) {
                    SetPauseModeSelection(false);
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_B) {
                    SetPauseModeSelection(true);
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) {
                    switch(FW_Common::pauseModeSelection) {
                        case FW_Const::PauseMode_Calibrate:
                          FW_Common::SetMode(FW_Const::GunMode_Calibration);
                          if(!OF_Serial::serialMode) {
                              Serial.print("Calibrating for current profile: ");
                              Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                          }
                          break;
                        case FW_Const::PauseMode_ProfileSelect:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Pick a profile!");
                              Serial.print("Current profile in use: ");
                              Serial.print(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                              Serial.print(" (");
                              Serial.print(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout ? "Diamond" : "Square");
                              Serial.println(")");
                          }
                          pauseModeSelectingProfile = true;
                          profileModeSelection = OF_Prefs::currentProfile;
                          #ifdef USES_DISPLAY
                              // 为每个配置文件名称添加布局类型信息
                              char profileNames[4][20]; // 为每个配置文件创建带布局信息的名称
                              for(int i = 0; i < PROFILE_COUNT; i++) {
                                  // 根据irLayout值添加布局类型
                                  if(OF_Prefs::profiles[i].irLayout) {
                                      snprintf(profileNames[i], sizeof(profileNames[i]), "%s (Diamond)", OF_Prefs::profiles[i].name);
                                  } else {
                                      snprintf(profileNames[i], sizeof(profileNames[i]), "%s (Square)", OF_Prefs::profiles[i].name);
                                  }
                              }
                              FW_Common::OLED.PauseProfileUpdate(profileModeSelection, profileNames[0], profileNames[1], profileNames[2], profileNames[3]);
                          #endif // USES_DISPLAY
                          #ifdef LED_ENABLE
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          break;
                        case FW_Const::PauseMode_Save:
                          if(!OF_Serial::serialMode)
                              Serial.println("Saving...");
                          FW_Common::SavePreferences();
                          break;
                        case FW_Const::PauseMode_AutofireToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling autofire...");
                          }
                          OF_Prefs::toggles[OF_Const::autofire] = !OF_Prefs::toggles[OF_Const::autofire];
                          if(!OF_Serial::serialMode) {
                              Serial.print("Autofire is now ");
                              Serial.println(OF_Prefs::toggles[OF_Const::autofire] ? "ON" : "OFF");
                          }
                          #ifdef USES_DISPLAY
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AutofireToggle);
                          #endif // USES_DISPLAY
                          #ifdef LED_ENABLE
                              if(OF_Prefs::toggles[OF_Const::autofire]) {
                                  OF_RGB::LedUpdate(0,255,0);
                              } else {
                                  OF_RGB::LedUpdate(255,0,0);
                              }
                              delay(200);
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          OF_Prefs::SaveToggles();
                          break;                          
 //wei13402 add start
                         case FW_Const::PauseMode_ModeChange:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Changing input mode...");
                          }
                          // Cycle through modes: Mouse/KB -> Gamepad -> MiSTer Optimized -> Mouse/KB
                          if(!FW_Common::buttons.analogOutput && !FW_Common::OLED.mister) {
                              // Current: Mouse/KB -> Switch to Gamepad
                              FW_Common::buttons.analogOutput = true;
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: Gamepad");
                          } else if(FW_Common::buttons.analogOutput && !FW_Common::OLED.mister) {
                              // Current: Gamepad -> Switch to MiSTer Optimized
                              FW_Common::OLED.mister = true;
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: MiSTer Optimized");
                          } else {
                              // Current: MiSTer Optimized -> Switch to Mouse/KB
                              FW_Common::buttons.analogOutput = false;
                              FW_Common::OLED.mister = false;
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: Mouse/Keyboard");
                          }
                          
                          // Save the new mode settings
                          OF_Prefs::toggles[OF_Const::analogOutputMode] = FW_Common::buttons.analogOutput;
                          OF_Prefs::toggles[OF_Const::misterMode] = FW_Common::OLED.mister;
                          OF_Prefs::SaveToggles();
                          
                          // Update display to show new mode
                          #ifdef USES_DISPLAY
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_ModeChange);
                          #endif // USES_DISPLAY
                          // Provide visual feedback
                          #ifdef LED_ENABLE
                              for(uint i = 0; i < 2; ++i) {
                                  OF_RGB::LedUpdate(0,255,255);
                                  delay(150);
                                  OF_RGB::LedOff();
                                  delay(100);
                              }
                          #endif // LED_ENABLE
                          break;
 //wei13102 add end
 //wei134102 add start
                         
                        case FW_Const::PauseMode_LowButtonToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling Low Button Mode!");
                          }
                          OF_Prefs::toggles[OF_Const::lowButtonsMode] = !OF_Prefs::toggles[OF_Const::lowButtonsMode];
                          if(!OF_Serial::serialMode) {
                              Serial.print("Low Button Mode ");
                              Serial.println(OF_Prefs::toggles[OF_Const::lowButtonsMode] ? "ON" : "OFF");
                          }
                          // Update display to show new state
                          #ifdef USES_DISPLAY
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_LowButtonToggle);
                          #endif // USES_DISPLAY
                          // Provide visual feedback
                          #ifdef LED_ENABLE
                              for(uint i = 0; i < 2; ++i) {
                                  OF_RGB::LedUpdate(255,165,0);
                                  delay(150);
                                  OF_RGB::LedOff();
                                  delay(100);
                              }
                          #endif // LED_ENABLE
                          OF_Prefs::SaveToggles();
                          // 更新按钮绑定以应用Low Button模式变更
                          FW_Common::UpdateBindings(false);
                          break;
                        case FW_Const::PauseMode_LayoutToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling Layout Type!");
                          }
                          // Toggle between Diamond and Square layout
                          if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond) {
                              OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout = OF_Const::layoutSquare;
                          } else {
                              OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout = OF_Const::layoutDiamond;
                          }
                          
                          if(!OF_Serial::serialMode) {
                              Serial.print("Layout changed to: ");
                              Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond ? "Diamond" : "Square");
                          }
                          
